In [21]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame({'last_name':['佐藤','山田','鈴木']})
df2 = pd.DataFrame({'first_name':['太郎','二郎','三郎']})

display(df1)
display(df2)

  last_name
0        佐藤
1        山田
2        鈴木

  first_name
0         太郎
1         二郎
2         三郎

In [19]:
pd.concat([df1, df2],axis=1)

    0   1
0  佐藤  太郎
1  山田  二郎
2  鈴木  三郎

In [22]:
df1.index = [1,0,2]
pd.concat([df1, df2],axis=1)

  last_name first_name
0        山田         太郎
1        佐藤         二郎
2        鈴木         三郎